{
    "name": "functional",
    "trainable": true,
    "layers": [
        {
            "module": "keras.layers",
            "class_name": "InputLayer",
            "config": {
                "batch_shape": [
                    null,
                    128,
                    128,
                    3
                ],
                "dtype": "float32",
                "sparse": false,
                "ragged": false,
                "name": "input_layer"
            },
            "registered_name": null,
            "name": "input_layer",
            "inbound_nodes": []
        },
        {
            "module": "keras.layers",
            "class_name": "Rescaling",
            "config": {
                "name": "rescaling",
                "trainable": true,
                "dtype": {
                    "module": "keras",
                    "class_name": "DTypePolicy",
                    "config": {
                        "name": "float32"
                    },
                    "registered_name": null
                },
                "scale": 0.00392156862745098,
                "offset": 0.0
            },
            "registered_name": null,
            "build_config": {
                "input_shape": [
                    null,
                    128,
                    128,
                    3
                ]
            },
            "name": "rescaling",
            "inbound_nodes": [
                {
                    "args": [
                        {
                            "class_name": "__keras_tensor__",
                            "config": {
                                "shape": [
                                    null,
                                    128,
                                    128,
                                    3
                                ],
                                "dtype": "float32",
                                "keras_history": [
                                    "input_layer",
                                    0,
                                    0
                                ]
                            }
                        }
                    ],
                    "kwargs": {}
                }
            ]
        },
        {
            "module": "keras.layers",
            "class_name": "Conv2D",
            "config": {
                "name": "conv2d",
                "trainable": true,
                "dtype": {
                    "module": "keras",
                    "class_name": "DTypePolicy",
                    "config": {
                        "name": "float32"
                    },
                    "registered_name": null
                },
                "filters": 32,
                "kernel_size": [
                    3,
                    3
                ],
                "strides": [
                    1,
                    1
                ],
                "padding": "valid",
                "data_format": "channels_last",
                "dilation_rate": [
                    1,
                    1
                ],
                "groups": 1,
                "activation": "relu",
                "use_bias": true,
                "kernel_initializer": {
                    "module": "keras.initializers",
                    "class_name": "GlorotUniform",
                    "config": {
                        "seed": null
                    },
                    "registered_name": null
                },
                "bias_initializer": {
                    "module": "keras.initializers",
                    "class_name": "Zeros",
                    "config": {},
                    "registered_name": null
                },
                "kernel_regularizer": null,
                "bias_regularizer": null,
                "activity_regularizer": null,
                "kernel_constraint": null,
                "bias_constraint": null
            },
            "registered_name": null,
            "build_config": {
                "input_shape": [
                    null,
                    128,
                    128,
                    3
                ]
            },
            "name": "conv2d",
            "inbound_nodes": [
                {
                    "args": [
                        {
                            "class_name": "__keras_tensor__",
                            "config": {
                                "shape": [
                                    null,
                                    128,
                                    128,
                                    3
                                ],
                                "dtype": "float32",
                                "keras_history": [
                                    "rescaling",
                                    0,
                                    0
                                ]
                            }
                        }
                    ],
                    "kwargs": {}
                }
            ]
        },
        {
            "module": "keras.layers",
            "class_name": "MaxPooling2D",
            "config": {
                "name": "max_pooling2d",
                "trainable": true,
                "dtype": {
                    "module": "keras",
                    "class_name": "DTypePolicy",
                    "config": {
                        "name": "float32"
                    },
                    "registered_name": null
                },
                "pool_size": [
                    2,
                    2
                ],
                "padding": "valid",
                "strides": [
                    2,
                    2
                ],
                "data_format": "channels_last"
            },
            "registered_name": null,
            "name": "max_pooling2d",
            "inbound_nodes": [
                {
                    "args": [
                        {
                            "class_name": "__keras_tensor__",
                            "config": {
                                "shape": [
                                    null,
                                    126,
                                    126,
                                    32
                                ],
                                "dtype": "float32",
                                "keras_history": [
                                    "conv2d",
                                    0,
                                    0
                                ]
                            }
                        }
                    ],
                    "kwargs": {}
                }
            ]
        },
        {
            "module": "keras.layers",
            "class_name": "Conv2D",
            "config": {
                "name": "conv2d_1",
                "trainable": true,
                "dtype": {
                    "module": "keras",
                    "class_name": "DTypePolicy",
                    "config": {
                        "name": "float32"
                    },
                    "registered_name": null
                },
                "filters": 64,
                "kernel_size": [
                    3,
                    3
                ],
                "strides": [
                    1,
                    1
                ],
                "padding": "valid",
                "data_format": "channels_last",
                "dilation_rate": [
                    1,
                    1
                ],
                "groups": 1,
                "activation": "relu",
                "use_bias": true,
                "kernel_initializer": {
                    "module": "keras.initializers",
                    "class_name": "GlorotUniform",
                    "config": {
                        "seed": null
                    },
                    "registered_name": null
                },
                "bias_initializer": {
                    "module": "keras.initializers",
                    "class_name": "Zeros",
                    "config": {},
                    "registered_name": null
                },
                "kernel_regularizer": null,
                "bias_regularizer": null,
                "activity_regularizer": null,
                "kernel_constraint": null,
                "bias_constraint": null
            },
            "registered_name": null,
            "build_config": {
                "input_shape": [
                    null,
                    63,
                    63,
                    32
                ]
            },
            "name": "conv2d_1",
            "inbound_nodes": [
                {
                    "args": [
                        {
                            "class_name": "__keras_tensor__",
                            "config": {
                                "shape": [
                                    null,
                                    63,
                                    63,
                                    32
                                ],
                                "dtype": "float32",
                                "keras_history": [
                                    "max_pooling2d",
                                    0,
                                    0
                                ]
                            }
                        }
                    ],
                    "kwargs": {}
                }
            ]
        },
        {
            "module": "keras.layers",
            "class_name": "MaxPooling2D",
            "config": {
                "name": "max_pooling2d_1",
                "trainable": true,
                "dtype": {
                    "module": "keras",
                    "class_name": "DTypePolicy",
                    "config": {
                        "name": "float32"
                    },
                    "registered_name": null
                },
                "pool_size": [
                    2,
                    2
                ],
                "padding": "valid",
                "strides": [
                    2,
                    2
                ],
                "data_format": "channels_last"
            },
            "registered_name": null,
            "name": "max_pooling2d_1",
            "inbound_nodes": [
                {
                    "args": [
                        {
                            "class_name": "__keras_tensor__",
                            "config": {
                                "shape": [
                                    null,
                                    61,
                                    61,
                                    64
                                ],
                                "dtype": "float32",
                                "keras_history": [
                                    "conv2d_1",
                                    0,
                                    0
                                ]
                            }
                        }
                    ],
                    "kwargs": {}
                }
            ]
        },
        {
            "module": "keras.layers",
            "class_name": "Conv2D",
            "config": {
                "name": "conv2d_2",
                "trainable": true,
                "dtype": {
                    "module": "keras",
                    "class_name": "DTypePolicy",
                    "config": {
                        "name": "float32"
                    },
                    "registered_name": null
                },
                "filters": 128,
                "kernel_size": [
                    3,
                    3
                ],
                "strides": [
                    1,
                    1
                ],
                "padding": "valid",
                "data_format": "channels_last",
                "dilation_rate": [
                    1,
                    1
                ],
                "groups": 1,
                "activation": "relu",
                "use_bias": true,
                "kernel_initializer": {
                    "module": "keras.initializers",
                    "class_name": "GlorotUniform",
                    "config": {
                        "seed": null
                    },
                    "registered_name": null
                },
                "bias_initializer": {
                    "module": "keras.initializers",
                    "class_name": "Zeros",
                    "config": {},
                    "registered_name": null
                },
                "kernel_regularizer": null,
                "bias_regularizer": null,
                "activity_regularizer": null,
                "kernel_constraint": null,
                "bias_constraint": null
            },
            "registered_name": null,
            "build_config": {
                "input_shape": [
                    null,
                    30,
                    30,
                    64
                ]
            },
            "name": "conv2d_2",
            "inbound_nodes": [
                {
                    "args": [
                        {
                            "class_name": "__keras_tensor__",
                            "config": {
                                "shape": [
                                    null,
                                    30,
                                    30,
                                    64
                                ],
                                "dtype": "float32",
                                "keras_history": [
                                    "max_pooling2d_1",
                                    0,
                                    0
                                ]
                            }
                        }
                    ],
                    "kwargs": {}
                }
            ]
        },
        {
            "module": "keras.layers",
            "class_name": "MaxPooling2D",
            "config": {
                "name": "max_pooling2d_2",
                "trainable": true,
                "dtype": {
                    "module": "keras",
                    "class_name": "DTypePolicy",
                    "config": {
                        "name": "float32"
                    },
                    "registered_name": null
                },
                "pool_size": [
                    2,
                    2
                ],
                "padding": "valid",
                "strides": [
                    2,
                    2
                ],
                "data_format": "channels_last"
            },
            "registered_name": null,
            "name": "max_pooling2d_2",
            "inbound_nodes": [
                {
                    "args": [
                        {
                            "class_name": "__keras_tensor__",
                            "config": {
                                "shape": [
                                    null,
                                    28,
                                    28,
                                    128
                                ],
                                "dtype": "float32",
                                "keras_history": [
                                    "conv2d_2",
                                    0,
                                    0
                                ]
                            }
                        }
                    ],
                    "kwargs": {}
                }
            ]
        },
        {
            "module": "keras.layers",
            "class_name": "Conv2D",
            "config": {
                "name": "conv2d_3",
                "trainable": true,
                "dtype": {
                    "module": "keras",
                    "class_name": "DTypePolicy",
                    "config": {
                        "name": "float32"
                    },
                    "registered_name": null
                },
                "filters": 256,
                "kernel_size": [
                    3,
                    3
                ],
                "strides": [
                    1,
                    1
                ],
                "padding": "valid",
                "data_format": "channels_last",
                "dilation_rate": [
                    1,
                    1
                ],
                "groups": 1,
                "activation": "relu",
                "use_bias": true,
                "kernel_initializer": {
                    "module": "keras.initializers",
                    "class_name": "GlorotUniform",
                    "config": {
                        "seed": null
                    },
                    "registered_name": null
                },
                "bias_initializer": {
                    "module": "keras.initializers",
                    "class_name": "Zeros",
                    "config": {},
                    "registered_name": null
                },
                "kernel_regularizer": null,
                "bias_regularizer": null,
                "activity_regularizer": null,
                "kernel_constraint": null,
                "bias_constraint": null
            },
            "registered_name": null,
            "build_config": {
                "input_shape": [
                    null,
                    14,
                    14,
                    128
                ]
            },
            "name": "conv2d_3",
            "inbound_nodes": [
                {
                    "args": [
                        {
                            "class_name": "__keras_tensor__",
                            "config": {
                                "shape": [
                                    null,
                                    14,
                                    14,
                                    128
                                ],
                                "dtype": "float32",
                                "keras_history": [
                                    "max_pooling2d_2",
                                    0,
                                    0
                                ]
                            }
                        }
                    ],
                    "kwargs": {}
                }
            ]
        },
        {
            "module": "keras.layers",
            "class_name": "MaxPooling2D",
            "config": {
                "name": "max_pooling2d_3",
                "trainable": true,
                "dtype": {
                    "module": "keras",
                    "class_name": "DTypePolicy",
                    "config": {
                        "name": "float32"
                    },
                    "registered_name": null
                },
                "pool_size": [
                    2,
                    2
                ],
                "padding": "valid",
                "strides": [
                    2,
                    2
                ],
                "data_format": "channels_last"
            },
            "registered_name": null,
            "name": "max_pooling2d_3",
            "inbound_nodes": [
                {
                    "args": [
                        {
                            "class_name": "__keras_tensor__",
                            "config": {
                                "shape": [
                                    null,
                                    12,
                                    12,
                                    256
                                ],
                                "dtype": "float32",
                                "keras_history": [
                                    "conv2d_3",
                                    0,
                                    0
                                ]
                            }
                        }
                    ],
                    "kwargs": {}
                }
            ]
        },
        {
            "module": "keras.layers",
            "class_name": "Conv2D",
            "config": {
                "name": "conv2d_4",
                "trainable": true,
                "dtype": {
                    "module": "keras",
                    "class_name": "DTypePolicy",
                    "config": {
                        "name": "float32"
                    },
                    "registered_name": null
                },
                "filters": 256,
                "kernel_size": [
                    3,
                    3
                ],
                "strides": [
                    1,
                    1
                ],
                "padding": "valid",
                "data_format": "channels_last",
                "dilation_rate": [
                    1,
                    1
                ],
                "groups": 1,
                "activation": "relu",
                "use_bias": true,
                "kernel_initializer": {
                    "module": "keras.initializers",
                    "class_name": "GlorotUniform",
                    "config": {
                        "seed": null
                    },
                    "registered_name": null
                },
                "bias_initializer": {
                    "module": "keras.initializers",
                    "class_name": "Zeros",
                    "config": {},
                    "registered_name": null
                },
                "kernel_regularizer": null,
                "bias_regularizer": null,
                "activity_regularizer": null,
                "kernel_constraint": null,
                "bias_constraint": null
            },
            "registered_name": null,
            "build_config": {
                "input_shape": [
                    null,
                    6,
                    6,
                    256
                ]
            },
            "name": "conv2d_4",
            "inbound_nodes": [
                {
                    "args": [
                        {
                            "class_name": "__keras_tensor__",
                            "config": {
                                "shape": [
                                    null,
                                    6,
                                    6,
                                    256
                                ],
                                "dtype": "float32",
                                "keras_history": [
                                    "max_pooling2d_3",
                                    0,
                                    0
                                ]
                            }
                        }
                    ],
                    "kwargs": {}
                }
            ]
        },
        {
            "module": "keras.layers",
            "class_name": "Flatten",
            "config": {
                "name": "flatten",
                "trainable": true,
                "dtype": {
                    "module": "keras",
                    "class_name": "DTypePolicy",
                    "config": {
                        "name": "float32"
                    },
                    "registered_name": null
                },
                "data_format": "channels_last"
            },
            "registered_name": null,
            "build_config": {
                "input_shape": [
                    null,
                    4,
                    4,
                    256
                ]
            },
            "name": "flatten",
            "inbound_nodes": [
                {
                    "args": [
                        {
                            "class_name": "__keras_tensor__",
                            "config": {
                                "shape": [
                                    null,
                                    4,
                                    4,
                                    256
                                ],
                                "dtype": "float32",
                                "keras_history": [
                                    "conv2d_4",
                                    0,
                                    0
                                ]
                            }
                        }
                    ],
                    "kwargs": {}
                }
            ]
        },
        {
            "module": "keras.layers",
            "class_name": "Dense",
            "config": {
                "name": "dense",
                "trainable": true,
                "dtype": {
                    "module": "keras",
                    "class_name": "DTypePolicy",
                    "config": {
                        "name": "float32"
                    },
                    "registered_name": null
                },
                "units": 1,
                "activation": "sigmoid",
                "use_bias": true,
                "kernel_initializer": {
                    "module": "keras.initializers",
                    "class_name": "GlorotUniform",
                    "config": {
                        "seed": null
                    },
                    "registered_name": null
                },
                "bias_initializer": {
                    "module": "keras.initializers",
                    "class_name": "Zeros",
                    "config": {},
                    "registered_name": null
                },
                "kernel_regularizer": null,
                "bias_regularizer": null,
                "kernel_constraint": null,
                "bias_constraint": null
            },
            "registered_name": null,
            "build_config": {
                "input_shape": [
                    null,
                    4096
                ]
            },
            "name": "dense",
            "inbound_nodes": [
                {
                    "args": [
                        {
                            "class_name": "__keras_tensor__",
                            "config": {
                                "shape": [
                                    null,
                                    4096
                                ],
                                "dtype": "float32",
                                "keras_history": [
                                    "flatten",
                                    0,
                                    0
                                ]
                            }
                        }
                    ],
                    "kwargs": {}
                }
            ]
        }
    ],
    "input_layers": [
        "input_layer",
        0,
        0
    ],
    "output_layers": [
        "dense",
        0,
        0
    ]
}